[
  {
    "id": "journal-001",
    "playerId": "1769309001001",
    "coachId": "1769307796095",
    "sessionDate": "2026-02-04",
    "sessionTime": "10:00",
    "summary": "Excellent session focusing on improving backhand consistency. Ava showed great improvement in her follow-through and footwork positioning.",
    "areasWorkedOn": [
      "backhand",
      "footwork"
    ],
    "pointersForNextSession": "Continue working on backhand cross-court shots. Focus on maintaining balance during the stroke. Practice split-step timing for better court coverage.",
    "additionalNotes": "Weather was perfect today. Ava is making excellent progress and showing strong commitment to improvement.",
    "playerReflection": "I really felt the difference in my backhand today! The footwork drills helped me feel more stable. Can't wait to practice the cross-court shots.",
    "createdAt": "2026-02-04T10:45:00.000Z",
    "lastModified": "2026-02-04T15:30:00.000Z",
    "createdBy": "1769307796095"
  },
  {
    "id": "journal-002",
    "playerId": "1769309001002",
    "coachId": "1769307796095",
    "sessionDate": "2026-02-03",
    "sessionTime": "14:30",
    "summary": "Worked on serve technique and power. Miles has a natural motion but needs to work on ball toss consistency.",
    "areasWorkedOn": [
      "serve",
      "strategy"
    ],
    "pointersForNextSession": "Practice ball toss at home with a target. Focus on tossing the ball in the same spot every time. Work on trophy position and shoulder rotation.",
    "additionalNotes": "Miles is very analytical and asks great questions about technique. Suggested watching some professional serves to study the motion.",
    "createdAt": "2026-02-03T15:15:00.000Z",
    "lastModified": "2026-02-03T15:15:00.000Z",
    "createdBy": "1769307796095"
  },
  {
    "id": "journal-003",
    "playerId": "1769309001003",
    "coachId": "1769307796095",
    "sessionDate": "2026-02-03",
    "sessionTime": "16:00",
    "summary": "Great session on volleys and net play. Priya is developing good instincts at the net and showing improved reflexes.",
    "areasWorkedOn": [
      "volley",
      "footwork",
      "strategy"
    ],
    "pointersForNextSession": "Work on approach shots - need to hit deeper to set up better volleys. Practice split-step at the service line before moving to the net.",
    "additionalNotes": "Priya's confidence at the net is growing. She's becoming more comfortable moving forward and taking control of points.",
    "playerReflection": "I'm starting to enjoy playing at the net! The volley drills were fun and I felt more confident closing out points.",
    "createdAt": "2026-02-03T17:00:00.000Z",
    "lastModified": "2026-02-03T18:45:00.000Z",
    "createdBy": "1769307796095"
  },
  {
    "id": "journal-004",
    "playerId": "1769309001001",
    "coachId": "1769307796095",
    "sessionDate": "2026-01-30",
    "sessionTime": "09:00",
    "summary": "Focused on forehand technique and developing a more aggressive playing style. Worked on hitting through the ball with more topspin.",
    "areasWorkedOn": [
      "forehand",
      "strategy",
      "mental"
    ],
    "pointersForNextSession": "Practice being more aggressive on second serves. Trust the forehand in rally situations. Work on mental confidence to take bigger swings.",
    "additionalNotes": "Ava tends to be too careful with her shots. Working on building confidence to be more aggressive when opportunities arise.",
    "playerReflection": "I need to remind myself to be more aggressive. I know I can hit harder, just need to trust my strokes more in matches.",
    "createdAt": "2026-01-30T10:00:00.000Z",
    "lastModified": "2026-01-30T19:20:00.000Z",
    "createdBy": "1769307796095"
  },
  {
    "id": "journal-005",
    "playerId": "1769309001002",
    "coachId": "1769307796095",
    "sessionDate": "2026-01-29",
    "sessionTime": "11:00",
    "summary": "Excellent fitness session combined with baseline consistency drills. Miles is building good endurance and rally tolerance.",
    "areasWorkedOn": [
      "fitness",
      "forehand",
      "backhand"
    ],
    "pointersForNextSession": "Continue fitness work - stamina is improving nicely. Work on maintaining technique quality even when tired. Practice recovery between points.",
    "additionalNotes": "Miles showed great determination during the fitness drills. His stroke mechanics stay consistent even when fatigued, which is impressive.",
    "createdAt": "2026-01-29T12:00:00.000Z",
    "lastModified": "2026-01-29T12:00:00.000Z",
    "createdBy": "1769307796095"
  },
  {
    "id": "journal-006",
    "playerId": "1769309001003",
    "coachId": "1769307796095",
    "sessionDate": "2026-01-28",
    "sessionTime": "15:30",
    "summary": "Mental game and match strategy session. Discussed point construction and when to attack vs defend. Played practice sets with strategic focus.",
    "areasWorkedOn": [
      "mental",
      "strategy"
    ],
    "pointersForNextSession": "Remember the patterns we discussed: serve wide, move opponent, attack short ball. Trust your game plan during pressure moments.",
    "additionalNotes": "Priya has excellent shot-making ability but sometimes gets too caught up in trying to hit winners. Working on patience and point construction.",
    "createdAt": "2026-01-28T17:00:00.000Z",
    "lastModified": "2026-01-28T17:00:00.000Z",
    "createdBy": "1769307796095"
  },
  {
    "id": "journal-007",
    "playerId": "1769309001001",
    "coachId": "1769307796095",
    "sessionDate": "2026-01-27",
    "sessionTime": "10:00",
    "summary": "Comprehensive session covering all groundstrokes and serve. Focused on consistency and rhythm. Ava is developing a reliable baseline game.",
    "areasWorkedOn": [
      "forehand",
      "backhand",
      "serve",
      "footwork"
    ],
    "pointersForNextSession": "Keep working on the service motion - it's coming together nicely. Practice forehand inside-out pattern to set up points offensively.",
    "additionalNotes": "Great all-around session. Ava is becoming a more complete player with fewer weaknesses.",
    "playerReflection": "Felt really good about everything today. My game is starting to feel more solid and reliable.",
    "createdAt": "2026-01-27T11:30:00.000Z",
    "lastModified": "2026-01-27T20:15:00.000Z",
    "createdBy": "1769307796095"
  },
  {
    "id": "journal-008",
    "playerId": "1769309001002",
    "coachId": "1769307796095",
    "sessionDate": "2026-01-25",
    "sessionTime": "13:00",
    "summary": "Return of serve practice and defensive positioning. Miles is learning to neutralize powerful serves and get into rallies.",
    "areasWorkedOn": [
      "backhand",
      "footwork",
      "strategy"
    ],
    "pointersForNextSession": "Practice return stance - small split step as opponent tosses. Focus on getting ball back deep in play to start the point on your terms.",
    "additionalNotes": "Miles has good hands and anticipation. Working on building confidence on return games.",
    "playerReflection": "Returns are tough but I'm starting to read serves better. Need to trust my backhand return more.",
    "createdAt": "2026-01-25T14:15:00.000Z",
    "lastModified": "2026-01-25T21:30:00.000Z",
    "createdBy": "1769307796095"
  },
  {
    "id": "journal-009",
    "playerId": "1769309001003",
    "coachId": "1769307796095",
    "sessionDate": "2026-01-23",
    "sessionTime": "16:00",
    "summary": "Serve and volley practice. Working on transitioning forward and finishing points at net. Priya has good touch and feel.",
    "areasWorkedOn": [
      "serve",
      "volley",
      "footwork"
    ],
    "pointersForNextSession": "Practice serve placement to set up easier volleys. Remember to close the net after first volley. Work on overhead technique.",
    "additionalNotes": "Priya's natural athleticism makes her a threat at the net. She's starting to enjoy the aggressive style of play.",
    "createdAt": "2026-01-23T17:15:00.000Z",
    "lastModified": "2026-01-23T17:15:00.000Z",
    "createdBy": "1769307796095"
  },
  {
    "id": "journal-010",
    "playerId": "1769309001001",
    "coachId": "1769307796095",
    "sessionDate": "2026-01-20",
    "sessionTime": "09:30",
    "summary": "Match simulation and competitive drills. Ava is learning to handle pressure situations and maintain focus during close games.",
    "areasWorkedOn": [
      "mental",
      "strategy",
      "fitness"
    ],
    "pointersForNextSession": "Practice breathing techniques between points to stay calm. Remember the mental routines we discussed for pressure moments.",
    "additionalNotes": "Ava won both practice sets today showing great mental toughness. She's ready to compete in club tournaments.",
    "playerReflection": "I stayed calm during the tiebreaker today! The mental practice is really helping me stay focused under pressure.",
    "createdAt": "2026-01-20T11:00:00.000Z",
    "lastModified": "2026-01-20T22:45:00.000Z",
    "createdBy": "1769307796095"
  },
  {
    "id": "journal-nico-001",
    "playerId": "1738780800001",
    "coachId": "1769307796095",
    "sessionDate": "2026-02-05",
    "sessionTime": "10:00",
    "summary": "Nico has incredible serve power - hitting consistent 110+ mph serves! However, first serve percentage is only around 40%. Need to work on consistency and placement over pure power.",
    "areasWorkedOn": [
      "serve",
      "strategy"
    ],
    "pointersForNextSession": "Focus on serve placement - aim for targets in corners rather than just hitting hard. Practice the 'smooth power' concept - 80% power with 100% accuracy. Work on second serve with more spin for safety.",
    "additionalNotes": "Nico's nickname 'Fireball' is well-deserved! But winning matches requires consistency. He's receptive to the idea of strategic serving.",
    "createdAt": "2026-02-05T11:00:00.000Z",
    "lastModified": "2026-02-05T11:00:00.000Z",
    "createdBy": "1769307796095"
  },
  {
    "id": "journal-nico-002",
    "playerId": "1738780800001",
    "coachId": "1769307796095",
    "sessionDate": "2026-02-03",
    "sessionTime": "14:00",
    "summary": "Serve consistency drills and placement work. Nico is starting to understand that placement beats power. Worked on serve+1 patterns.",
    "areasWorkedOn": [
      "serve",
      "strategy",
      "forehand"
    ],
    "pointersForNextSession": "Continue serve target practice. After serve, look for forehand patterns - serve wide, hit inside-out forehand. Build points strategically rather than going for winners immediately.",
    "additionalNotes": "Good progress on consistency. First serve percentage improved to 55% when focusing on targets.",
    "playerReflection": "I get it now - placing serves in corners makes the next shot easier. Don't need to hit as hard if I'm smart about it.",
    "createdAt": "2026-02-03T15:00:00.000Z",
    "lastModified": "2026-02-03T18:00:00.000Z",
    "createdBy": "1769307796095"
  },
  {
    "id": "journal-nico-003",
    "playerId": "1738780800001",
    "coachId": "1769307796095",
    "sessionDate": "2026-02-01",
    "sessionTime": "11:30",
    "summary": "Rally tolerance and baseline consistency. Nico tends to go for big shots too early in rallies. Working on patience and point construction.",
    "areasWorkedOn": [
      "forehand",
      "backhand",
      "strategy",
      "mental"
    ],
    "pointersForNextSession": "Practice the 'three-ball rule' - hit three solid rally balls before going for a winner. Trust that opportunities will come. Work on recognizing short balls vs defensive balls.",
    "additionalNotes": "Nico's power is both his strength and weakness. Learning patience is key for his development.",
    "playerReflection": "It's hard to hold back when I see an opening, but I'm losing too many points trying to hit winners too soon.",
    "createdAt": "2026-02-01T12:30:00.000Z",
    "lastModified": "2026-02-01T19:00:00.000Z",
    "createdBy": "1769307796095"
  },
  {
    "id": "journal-nico-004",
    "playerId": "1738780800001",
    "coachId": "1769307796095",
    "sessionDate": "2026-01-29",
    "sessionTime": "09:00",
    "summary": "First session with Nico. Assessed current game level. Strong serve, aggressive baseline game, but struggles with consistency. Tends to overpower shots and make unforced errors.",
    "areasWorkedOn": [
      "serve",
      "forehand",
      "backhand"
    ],
    "pointersForNextSession": "Main focus: consistency over power. Work on completing rallies rather than ending them early. Practice controlled aggression.",
    "additionalNotes": "Nico is enthusiastic and powerful player. Has potential but needs to develop consistency and court sense. Watching too much ATP tour tennis and trying to hit like pros before building fundamentals.",
    "createdAt": "2026-01-29T10:00:00.000Z",
    "lastModified": "2026-01-29T10:00:00.000Z",
    "createdBy": "1769307796095"
  },
  {
    "id": "journal-nico-005",
    "playerId": "1738780800001",
    "coachId": "1769307796095",
    "sessionDate": "2026-01-27",
    "sessionTime": "15:00",
    "summary": "Mental game and match strategy session. Discussed when to go for winners vs when to stay patient. Worked on reading opponent positioning.",
    "areasWorkedOn": [
      "mental",
      "strategy"
    ],
    "pointersForNextSession": "Remember: patience is power. The player who makes the last ball in wins the point. Use your power when you have a clear advantage, not on every shot.",
    "additionalNotes": "Nico is very coachable and understands the concepts intellectually. Now needs to implement them in practice.",
    "playerReflection": "I know I need to be more patient but it's tough! Going to try the three-ball rule in my next practice.",
    "createdAt": "2026-01-27T16:00:00.000Z",
    "lastModified": "2026-01-27T20:30:00.000Z",
    "createdBy": "1769307796095"
  }
]
